export const TreeData = [
    {
        text:"北京市",
        id:1,
        children:[{
            text:"北京市",
            id:'1-1',
            children:[
                {
                    id:"110101",
                    text: "东城区",
                },{
                    id:"110102",
                    text: "西城区",
                },{
                    id:"110105",
                    text: "朝阳区",
                },{
                    id:"110106",
                    text: "丰台区",
                },{
                    id:"110107",
                    text: "石景山区",
                },{
                    id:"110108",
                    text: "海淀区",
                },{
                    id:"110109",
                    text: "门头沟区",
                },{
                    id:"110111",
                    text: "房山区",
                },{
                    id:"110112",
                    text: "通州区",
                },{
                    id:"110113",
                    text: "顺义区",
                },{
                    id:"110114",
                    text: "昌平区",
                },{
                    id:"110115",
                    text: "大兴区",
                },{
                    id:"110116",
                    text: "怀柔区",
                },{
                    id:"110117",
                    text: "平谷区",
                },{
                    id:"110118",
                    text: "密云区",
                },{
                    id:"110119",
                    text: "延庆区"
            }]
        }]
    },
    {
        text:"河北省",
        id:2,
        children:[
            {
                id:"130100",
                text: "石家庄市",
            },{
                id:"130200",
                text: "唐山市",
            },{
                id:"130300",
                text: "秦皇岛市",
            },{
                id:"130400",
                text: "邯郸市",
            },{
                id:"130500",
                text: "邢台市",
            },{
                id:"130600",
                text: "保定市",
            },{
                id:"130700",
                text: "张家口市",
            },{
                id:"130800",
                text: "承德市",
            },{
                id:"130900",
                text: "沧州市",
            },{
                id:"131000",
                text: "廊坊市",
            },{
                id:"131100",
                text: "衡水市"
        }]
    },
    {
        text:"山西省",
        id:3,
        children:[
            {
                id:"140100",
                text: "太原市",
            },{
                id:"140200",
                text: "大同市",
            },{
                id:"140300",
                text: "阳泉市",
            },{
                id:"140400",
                text: "长治市",
            },{
                id:"140500",
                text: "晋城市",
            },{
                id:"140600",
                text: "朔州市",
            },{
                id:"140700",
                text: "晋中市",
            },{
                id:"140800",
                text: "运城市",
            },{
                id:"140900",
                text: "忻州市",
            },{
                id:"141000",
                text: "临汾市",
            },{
                id:"141100",
                text: "吕梁市"
        }]
    },
    {
        text:"内蒙古自治区",
        id:4,
        children:[
            {
                id:"150100",
                text: "呼和浩特市",
            },{
                id:"150200",
                text: "包头市",
            },{
                id:"150300",
                text: "乌海市",
            },{
                id:"150400",
                text: "赤峰市",
            },{
                id:"150500",
                text: "通辽市",
            },{
                id:"150600",
                text: "鄂尔多斯市",
            },{
                id:"150700",
                text: "呼伦贝尔市",
            },{
                id:"150800",
                text: "巴彦淖尔市",
            },{
                id:"150900",
                text: "乌兰察布市",
            },{
                id:"152200",
                text: "兴安盟",
            },{
                id:"152500",
                text: "锡林郭勒盟",
            },{
                id:"152900",
                text: "阿拉善盟"
            }]
    },
    {
        text:"辽宁省",
        id:5,
        children:[
            {
                id:"210100",
                text: "沈阳市",
            },{
                id:"210200",
                text: "大连市",
            },{
                id:"210300",
                text: "鞍山市",
            },{
                id:"210400",
                text: "抚顺市",
            },{
                id:"210500",
                text: "本溪市",
            },{
                id:"210600",
                text: "丹东市",
            },{
                id:"210700",
                text: "锦州市",
            },{
                id:"210800",
                text: "营口市",
            },{
                id:"210900",
                text: "阜新市",
            },{
                id:"211000",
                text: "辽阳市",
            },{
                id:"211100",
                text: "盘锦市",
            },{
                id:"211200",
                text: "铁岭市",
            },{
                id:"211300",
                text: "朝阳市",
            },{
                id:"211400",
                text: "葫芦岛市"
        }]
    }]